Hello, thanks for your answer

Here is the debug output log of this command:
```
TF_LOG=debug terraform import 'module.ovh_managed_kubernetes.ovh_vrack.vrack' 'pn-1183558' > /tmp/output.log 2>&1
```

[output_redacted.log](https://github.com/user-attachments/files/17228226/output_redacted.log)

Here is the output of terraform plan after the import:
```diff
  # module.ovh_managed_kubernetes.ovh_vrack.vrack must be replaced
-/+ resource "ovh_vrack" "vrack" {
      ~ id             = "pn-REDACTED" -> (known after apply)
        name           = "REDACTED"
      ~ ovh_subsidiary = "FR" -> (known after apply) # forces replacement
      ~ service_name   = "pn-REDACTED" -> (known after apply)
      ~ urn            = "urn:v1:eu:resource:vrack:pn-REDACTED" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ order (known after apply)

      ~ plan {
          ~ duration     = "P1M" -> (known after apply)
          ~ pricing_mode = "default" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }
```